espressif/esp-matter/examples/common/secondary_ble_adv/platform/ESP32_custom/nimble/BLEManagerImpl.cpp
        err = MapBLEError(ble_gap_ext_adv_set_data(kChipAdvInstance, data));
        if (err != CHIP_NO_ERROR)
        {
            ChipLogError(DeviceLayer, "os_mbuf_append failed: %s", ErrorStr(err));
            return err;
        }

        if (mScanResponse.HasValue())
        {
            uint16_t resp_size         = static_cast<uint16_t>(mScanResponse.Value().size());
            struct os_mbuf * resp_data = os_msys_get_pkthdr(resp_size, 0);
            assert(resp_data);
            err = MapBLEError(os_mbuf_append(resp_data, mScanResponse.Value().data(), resp_size));
            if (err != CHIP_NO_ERROR)
            {
                ChipLogError(DeviceLayer, "os_mbuf_append failed: %s", ErrorStr(err));
                return err;
            }
            err = MapBLEError(ble_gap_ext_adv_rsp_set_data(kChipAdvInstance, resp_data));
            if (err != CHIP_NO_ERROR)
            {
                ChipLogError(DeviceLayer, "ble_gap_ext_adv_rsp_set_data failed: %s", ErrorStr(err));
                return err;
            }
        }
        err = MapBLEError(ble_gap_ext_adv_start(kChipAdvInstance, 0, 0));
        if (err != CHIP_NO_ERROR)
        {
            ChipLogError(DeviceLayer, "ble_gap_ext_adv_start() failed: %s", ErrorStr(err));
        }
    }
    return err;
}

int BLEManagerImpl::secondary_ble_svr_gap_event(struct ble_gap_event * event, void * arg)
{
    if (chip::DeviceLayer::Internal::BLEMgrImpl().mSecondaryBleGapEventHandler) {
        return chip::DeviceLayer::Internal::BLEMgrImpl().mSecondaryBleGapEventHandler(event, arg);
    }
    return 0;
}

CHIP_ERROR BLEManagerImpl::ConfigureSecondaryAdvertisingData(void)
{
    memset(&mSecondaryAdvFields, 0, sizeof(mSecondaryAdvFields));
    mSecondaryAdvFields.flags = (BLE_HS_ADV_F_DISC_GEN | BLE_HS_ADV_F_BREDR_UNSUP);
    mSecondaryAdvFields.num_uuids128 = 1;
    mSecondaryAdvFields.uuids128_is_complete = 1;
    mSecondaryAdvFields.uuids128 = &mSecondaryAdvUuid;

    memset(&mSecondaryRespFields, 0, sizeof(mSecondaryRespFields));
    mSecondaryRespFields.name = (const uint8_t *)mSecondaryAdvDeviceName;
    mSecondaryRespFields.name_len = (uint8_t)strlen(mSecondaryAdvDeviceName);
    mSecondaryRespFields.name_is_complete = 1;
    return CHIP_NO_ERROR;
}

CHIP_ERROR BLEManagerImpl::StartSecondaryAdvertising(void)
{
    CHIP_ERROR err;
    uint8_t secondary_own_addr_type;
    err = MapBLEError(ble_hs_util_ensure_addr(0));
    if (err != CHIP_NO_ERROR) {
        ESP_LOGE(TAG, "Error loading address");
        return err;
    }

    /* Figure out address to use while advertising (no privacy for now) */
    err = MapBLEError(ble_hs_id_infer_auto(0, &secondary_own_addr_type));
    if (err != CHIP_NO_ERROR) {
        ChipLogError(DeviceLayer, "ble_hs_id_infer_auto() failed: %s, cannot restart", ErrorStr(err));
        return err;
    }
    ble_gap_ext_adv_params adv_params;
    memset(&adv_params, 0, sizeof(adv_params));
    adv_params.scannable     = 1;
    adv_params.own_addr_type = secondary_own_addr_type;
    adv_params.legacy_pdu    = 1;
    adv_params.connectable = 1;
    adv_params.itvl_min = 0x100;
    adv_params.itvl_max = 0x100;

    if (ble_gap_ext_adv_active(kSecondaryAdvInstance))
    {
        /* Advertising is already active. Stop and restart with the new parameters */
        ChipLogProgress(DeviceLayer, "Device already advertising, stop active advertisement and restart");
        err = MapBLEError(ble_gap_ext_adv_stop(kSecondaryAdvInstance));
        if (err != CHIP_NO_ERROR)
        {
            ChipLogError(DeviceLayer, "ble_gap_ext_adv_stop() failed: %s, cannot restart", ErrorStr(err));
            return err;
        }
    }
    err = MapBLEError(ble_gap_ext_adv_configure(kSecondaryAdvInstance, &adv_params, NULL, secondary_ble_svr_gap_event, NULL));
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "ble_gap_ext_adv_configure failed: %s", ErrorStr(err));
        return err;
    }

    struct os_mbuf * data = os_msys_get_pkthdr(BLE_HCI_MAX_ADV_DATA_LEN, 0);
    assert(data);
    err = MapBLEError(ble_hs_adv_set_fields_mbuf(&mSecondaryAdvFields, data));
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "ble_hs_adv_set_fields_mbuf failed: %s", ErrorStr(err));
        return err;
    }
    err = MapBLEError(ble_gap_ext_adv_set_data(kSecondaryAdvInstance, data));
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "ble_gap_ext_adv_set_data failed: %s", ErrorStr(err));
        return err;
    }

    struct os_mbuf * resp_data = os_msys_get_pkthdr(BLE_HCI_MAX_ADV_DATA_LEN, 0);
    assert(resp_data);
    err = MapBLEError(ble_hs_adv_set_fields_mbuf(&mSecondaryRespFields, resp_data));
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "ble_hs_adv_set_fields_mbuf failed: %s", ErrorStr(err));
        return err;
    }
    err = MapBLEError(ble_gap_ext_adv_rsp_set_data(kSecondaryAdvInstance, resp_data));
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "ble_gap_ext_adv_set_data failed: %s", ErrorStr(err));
        return err;
    }
    err = MapBLEError(ble_gap_ext_adv_start(kSecondaryAdvInstance, 0, 0));
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "ble_gap_ext_adv_start() failed: %s", ErrorStr(err));
    }
    return err;
}

void BLEManagerImpl::DriveBLEState(intptr_t arg)
{
    sInstance.DriveBLEState();
}

#ifdef CONFIG_ENABLE_ESP32_BLE_CONTROLLER
CHIP_ERROR BLEManagerImpl::HandleRXNotify(struct ble_gap_event * ble_event)
{
    uint16_t dataLen               = OS_MBUF_PKTLEN(ble_event->notify_rx.om);
    System::PacketBufferHandle buf = System::PacketBufferHandle::New(dataLen, 0);
    VerifyOrReturnError(!buf.IsNull(), CHIP_ERROR_NO_MEMORY);
    VerifyOrReturnError(buf->AvailableDataLength() >= dataLen, CHIP_ERROR_BUFFER_TOO_SMALL);
    ble_hs_mbuf_to_flat(ble_event->notify_rx.om, buf->Start(), dataLen, NULL);
    buf->SetDataLength(dataLen);

    ChipLogDetail(DeviceLayer, "Indication received, conn = %d", ble_event->notify_rx.conn_handle);

    ChipDeviceEvent event;
    event.Type                                       = DeviceEventType::kPlatformESP32BLEIndicationReceived;
    event.Platform.BLEIndicationReceived.mConnection = ble_event->notify_rx.conn_handle;
    event.Platform.BLEIndicationReceived.mData       = std::move(buf).UnsafeRelease();
    PlatformMgr().PostEventOrDie(&event);

